Tekla Open API Reference for Tekla Structures 2025
Loop Class
 The Loop class represents a single loop in a face.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Solid.Loop
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class Loop
Public NotInheritable Class Loop
The Loop type exposes the following members.
Methods
Name | Description
GetVertexEnumerator
 Gets a new vertex enumerator.
Top
See Also
Reference
Tekla.Structures.Solid Namespace